import Link from 'next/link'
import styles from './styles.module.scss'
import clsx from 'clsx'
import { ButtonProps } from '../Promo'

type LetterProps = {
    title: string;
    button: ButtonProps;
}

export default function Letter(props: LetterProps) {
    const { title, button } = props;

    return (
        <div className={clsx('bs-flex-container', styles.wrapper)}>
            <h1 className='color-red'>{title}</h1>

            <div className={styles.content}>
                <h2>
                    Зай, с 14 февраля тебя {"<3"}
                </h2>
                <h3 style={{ marginTop: '10px', marginBottom: '10px' }}>
                    <span>Знаешь, рядом с тобой со мной происходит какая-то магия: весь стресс, все проблемы как будто выключаются одной кнопкой.</span>
                    <br />
                    И эта кнопка ты.
                    <br /><br />
                    {/* Ты для меня не просто любимая девушка — ты мой уют, моё спокойствие и моё самое тёплое «домой» и вообще с тобой становлюсь я лучше.
                    <br /><br /> */}
                    Мне очень повезло и я очень рад, что мы вместе.
                    И я хочу, чтобы впереди у нас было ещё много наших дней: с объятиями, шутками, маленькими приключениями и большими мечтами.
                    Хочу встречать с тобой не только этот февраль, а каждый следующий — вместе, рядом.
                    <br /><br />
                    Спасибо тебе за тебя.
                    Ты у меня особенная.
                    <br />
                    Твой аянчик 💌
                </h3>
            </div>

            <Link href={button.href} className={button.className}>
                {button.caption}
            </Link>
        </div>
    )
}